 /*******************************************************************************************
程序名： LED流水灯
编写人： 花花雪
编写时间： 2016 年 7月6 日
硬件支持：AT89S52 
接口说明：
修改日志：
NO.1
/*******************************************************************************************
//说明 ：延时控制LED灯亮灭
			
*******************************************************************************************/
  //[单片机常用SFR头文件]
  # include <REG52.h> 
  # include <intrins.h>
 // [常用定义声明]
  # define uint unsigned int 
  # define uchar unsigned char
  uchar a;
 void delay_ms(uint x)
  {
  		uint i,j;
		for(i=x;i>0;i++)
			for(j=110;j>0;j++);

  }

  void main()
  {		
  		a=0xaa;
	
  		while(1)
		{
  			a = a<<1 ;
			P1 = a ;
			delay_ms(400);
			
		}	
		 
  }
 